createskyblue/esp32s3_idf_template/sdkconfig.defaults
# 串口日志走 USB-Serial-JTAG（原生 USB 口, 与烧录同一虚拟串口）
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 立创实战派 = ESP32-S3（不依赖 VSCode 扩展设置 IDF_TARGET, 固化到 defaults）
CONFIG_IDF_TARGET="esp32s3"

CONFIG_PARTITION_TABLE_SINGLE_APP=n
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
# CONFIG_FREERTOS_USE_IDLE_HOOK is not set

# ESP32-S3 立创实战派: 16 MB flash + 8 MB octal PSRAM for application buffers.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
# CONFIG_SPIRAM_USE_CAPS_ALLOC is not set
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=n

#
# BLE (NimBLE host) + BluFi 配网
# CONFIG_BLE_ENABLED:BLE 总开关;CONFIG_BLUFI_PROVISIONING_ENABLED:配网(依赖 BLE)
# 关闭两者则整个蓝牙栈都不编译(省 ~40 KB SRAM)
#
# Temporarily disabled (keep code, flip to y to restore; saves ~40KB SRAM)
CONFIG_BLE_ENABLED=n
CONFIG_BLUFI_PROVISIONING_ENABLED=n
CONFIG_BT_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=n
# CONFIG_BT_NIMBLE_BLUFI_ENABLE is not set

#
# LED 模块（立创实战派无板载 LED，默认关闭；代码保留，需要时置 y）
#
CONFIG_LED_TASK_ENABLE=n

#
# LVGL 9.5 (Kconfig 配置方式, CONFIG_LV_CONF_SKIP=y 即不使用 lv_conf.h)
# 参考 ESP32_PAR20_4H_IDF 项目的 sdkconfig
#
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_MEM_SIZE_KILOBYTES=8
CONFIG_LV_DEF_REFR_PERIOD=16

# FreeRTOS 1000 Hz tick: ms-resolution timers + correct vTaskDelay()
CONFIG_FREERTOS_HZ=1000

CONFIG_LV_DPI_DEF=130
CONFIG_LV_OS_NONE=y
CONFIG_LV_USE_DRAW_SW=y
CONFIG_LV_DRAW_SW_SUPPORT_RGB565=y
CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED=y
CONFIG_LV_USE_FLOAT=y
# LVGL built-in performance monitor: on-screen FPS + CPU (and memory) window.
# Shown automatically by lv_display_create(); replaces any custom FPS logging.
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_PERF_MONITOR_ALIGN_TOP_LEFT=y
CONFIG_LV_USE_MEM_MONITOR=y
CONFIG_LV_MEM_MONITOR_ALIGN_BOTTOM_LEFT=y

CONFIG_LV_USE_MATRIX=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=y
# 演示/示例与矢量图形不编译, 减小体积与编译时间
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_LV_USE_THORVG=n
# LVGL draw buffers: y=PSRAM (default), n=DRAM (refresh benchmark)
CONFIG_LCD_LVGL_BUF_IN_PSRAM=y

# ESP32-S3 runs up to 240 MHz; template defaulted to 160 MHz which slows LVGL rendering
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240


# LVGL 官方 widget 示例关闭（替换为自带演示屏: 旋转按钮 + WiFi/IP, 见 lcd_lvgl.c）
CONFIG_LV_USE_DEMO_WIDGETS=n

# 网页截图调试功能(LVGL 快照渲染, /screenshot 端点)
CONFIG_LV_USE_SNAPSHOT=y

# 任务看门狗：widget demo 软件文字渲染较慢，留足余量
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# LVGL 堆走 C malloc + PSRAM（demo 峰值内存需求大，48KB 静态池会 OOM 死循环）
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_SPIRAM_USE_MALLOC=y

# ---- DMA 稳定性(回流自 ESP32S3_VoiceInput, 参考 esp32s3-ai-circuit-toy):
# GDMA 代码入 IRAM, 对象驻 DRAM。I2S 音频 DMA 与 AES 加密 DMA 等并发时,
# 闪存缓存争用会拖死 DMA ISR 导致内存损坏 ----
CONFIG_GDMA_CTRL_FUNC_IN_IRAM=y
CONFIG_GDMA_ISR_HANDLER_IN_IRAM=y
CONFIG_GDMA_OBJ_DRAM_SAFE=y

# ---- TLS 内存优化: 握手后释放握手数据/证书, 记录缓冲按实际大小动态分配
# (mbedTLS 占用 ~40KB 内部 RAM → 动态缓冲后大幅下降) ----
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y

# main 任务栈 3584 太小(开机路径含 cJSON_Parse 等深调用), 加大到 8192
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
